{"album":{"name":"Dookie","artist":"Green Day","mbid":"9fd4b403-7967-4ebd-9517-1581dee83fae","url":"https://www.last.fm/music/Green+Day/Dookie","image":[{"#text":"https://lastfm.freetls.fastly.net/i/u/34s/e3c38d611af74d2fcd599585e54c5601.png","size":"small"},{"#text":"https://lastfm.freetls.fastly.net/i/u/64s/e3c38d611af74d2fcd599585e54c5601.png","size":"medium"},{"#text":"https://lastfm.freetls.fastly.net/i/u/174s/e3c38d611af74d2fcd599585e54c5601.png","size":"large"},{"#text":"https://lastfm.freetls.fastly.net/i/u/300x300/e3c38d611af74d2fcd599585e54c5601.png","size":"extralarge"},{"#text":"https://lastfm.freetls.fastly.net/i/u/300x300/e3c38d611af74d2fcd599585e54c5601.png","size":"mega"},{"#text":"https://lastfm.freetls.fastly.net/i/u/300x300/e3c38d611af74d2fcd599585e54c5601.png","size":""}],"listeners":"1523987","playcount":"24337264","tracks":{"track":[{"name":"Burnout","url":"https://www.last.fm/music/Green+Day/_/Burnout","duration":"127","@attr":{"rank":"1"},"streamable":{"#text":"0","fulltrack":"0"},"artist":{"name":"Green Day","mbid":"084308bd-1654-436f-ba03-df6697104e19","url":"https://www.last.fm/music/Green+Day"}},{"name":"Having a Blast","url":"https://www.last.fm/music/Green+Day/_/Having+a+Blast","duration":"164","@attr":{"rank":"2"},"streamable":{"#text":"0","fulltrack":"0"},"artist":{"name":"Green Day","mbid":"084308bd-1654-436f-ba03-df6697104e19","url":"https://www.last.fm/music/Green+Day"}},{"name":"Chump","url":"https://www.last.fm/music/Green+Day/_/Chump","duration":"174","@attr":{"rank":"3"},"streamable":{"#text":"0","fulltrack":"0"},"artist":{"name":"Green Day","mbid":"084308bd-1654-436f-ba03-df6697104e19","url":"https://www.last.fm/music/Green+Day"}},{"name":"Longview","url":"https://www.last.fm/music/Green+Day/_/Longview","duration":"239","@attr":{"rank":"4"},"streamable":{"#text":"0","fulltrack":"0"},"artist":{"name":"Green Day","mbid":"084308bd-1654-436f-ba03-df6697104e19","url":"https://www.last.fm/music/Green+Day"}},{"name":"Welcome to Paradise","url":"https://www.last.fm/music/Green+Day/_/Welcome+to+Paradise","duration":"224","@attr":{"rank":"5"},"streamable":{"#text":"0","fulltrack":"0"},"artist":{"name":"Green Day","mbid":"084308bd-1654-436f-ba03-df6697104e19","url":"https://www.last.fm/music/Green+Day"}},{"name":"Pulling Teeth","url":"https://www.last.fm/music/Green+Day/_/Pulling+Teeth","duration":"150","@attr":{"rank":"6"},"streamable":{"#text":"0","fulltrack":"0"},"artist":{"name":"Green Day","mbid":"084308bd-1654-436f-ba03-df6697104e19","url":"https://www.last.fm/music/Green+Day"}},{"name":"Basket Case","url":"https://www.last.fm/music/Green+Day/_/Basket+Case","duration":"181","@attr":{"rank":"7"},"streamable":{"#text":"0","fulltrack":"0"},"artist":{"name":"Green Day","mbid":"084308bd-1654-436f-ba03-df6697104e19","url":"https://www.last.fm/music/Green+Day"}},{"name":"She","url":"https://www.last.fm/music/Green+Day/_/She","duration":"134","@attr":{"rank":"8"},"streamable":{"#text":"0","fulltrack":"0"},"artist":{"name":"Green Day","mbid":"084308bd-1654-436f-ba03-df6697104e19","url":"https://www.last.fm/music/Green+Day"}},{"name":"Sassafras Roots","url":"https://www.last.fm/music/Green+Day/_/Sassafras+Roots","duration":"157","@attr":{"rank":"9"},"streamable":{"#text":"0","fulltrack":"0"},"artist":{"name":"Green Day","mbid":"084308bd-1654-436f-ba03-df6697104e19","url":"https://www.last.fm/music/Green+Day"}},{"name":"When I Come Around","url":"https://www.last.fm/music/Green+Day/_/When+I+Come+Around","duration":"178","@attr":{"rank":"10"},"streamable":{"#text":"0","fulltrack":"0"},"artist":{"name":"Green Day","mbid":"084308bd-1654-436f-ba03-df6697104e19","url":"https://www.last.fm/music/Green+Day"}},{"name":"Coming Clean","url":"https://www.last.fm/music/Green+Day/_/Coming+Clean","duration":"95","@attr":{"rank":"11"},"streamable":{"#text":"0","fulltrack":"0"},"artist":{"name":"Green Day","mbid":"084308bd-1654-436f-ba03-df6697104e19","url":"https://www.last.fm/music/Green+Day"}},{"name":"Emenius Sleepus","url":"https://www.last.fm/music/Green+Day/_/Emenius+Sleepus","duration":"103","@attr":{"rank":"12"},"streamable":{"#text":"0","fulltrack":"0"},"artist":{"name":"Green Day","mbid":"084308bd-1654-436f-ba03-df6697104e19","url":"https://www.last.fm/music/Green+Day"}},{"name":"In the End","url":"https://www.last.fm/music/Green+Day/_/In+the+End","duration":"106","@attr":{"rank":"13"},"streamable":{"#text":"0","fulltrack":"0"},"artist":{"name":"Green Day","mbid":"084308bd-1654-436f-ba03-df6697104e19","url":"https://www.last.fm/music/Green+Day"}},{"name":"F.O.D.","url":"https://www.last.fm/music/Green+Day/_/F.O.D.","duration":"248","@attr":{"rank":"14"},"streamable":{"#text":"0","fulltrack":"0"},"artist":{"name":"Green Day","mbid":"084308bd-1654-436f-ba03-df6697104e19","url":"https://www.last.fm/music/Green+Day"}},{"name":"All by Myself","url":"https://www.last.fm/music/Green+Day/_/All+by+Myself","duration":"98","@attr":{"rank":"15"},"streamable":{"#text":"0","fulltrack":"0"},"artist":{"name":"Green Day","mbid":"084308bd-1654-436f-ba03-df6697104e19","url":"https://www.last.fm/music/Green+Day"}}]},"tags":{"tag":[{"name":"albums I own","url":"https://www.last.fm/tag/albums+I+own"},{"name":"punk rock","url":"https://www.last.fm/tag/punk+rock"},{"name":"punk","url":"https://www.last.fm/tag/punk"},{"name":"90s","url":"https://www.last.fm/tag/90s"},{"name":"rock","url":"https://www.last.fm/tag/rock"}]},"wiki":{"published":"13 Jun 2009, 18:22","summary":"Dookie is the third studio album and the major label debut by American punk rock band Green Day. The album was the band's first collaboration with producer Rob Cavallo. Released on February 1, 1994 through Reprise Records, Dookie became a worldwide commercial success, reaching number two on the U.S. Billboard 200 and charting in seven countries. The album helped to propel Green Day into mainstream popularity, amid claims from the punk rock community that the band had \"sold out\". <a href=\"http://www.last.fm/music/Green+Day/Dookie\">Read more on Last.fm</a>.","content":"Dookie is the third studio album and the major label debut by American punk rock band Green Day. The album was the band's first collaboration with producer Rob Cavallo. Released on February 1, 1994 through Reprise Records, Dookie became a worldwide commercial success, reaching number two on the U.S. Billboard 200 and charting in seven countries. The album helped to propel Green Day into mainstream popularity, amid claims from the punk rock community that the band had \"sold out\".\n\nDookie produced five singles for the band: \"Longview\", the re-recorded \"Welcome to Paradise\", \"Basket Case\", the radio-only single \"She\" and \"When I Come Around\". As of 2008, Dookie is the band's best-selling album, with over 15 million copies sold worldwide. Dookie won the Grammy Award for Best Alternative Music Album in 1995.\n\nFollowing the underground success of the band's second album Kerplunk (1992), a number of major labels became interested in Green Day. Representatives of these labels attempted to entice the band to sign by inviting them for meals to discuss a deal, with one manager even inviting the group to Disneyland. The band declined these advances until meeting producer and Reprise representative Rob Cavallo. They were impressed by his work with fellow Californian band The Muffs, and later remarked that Cavallo \"was the only person we could really talk to and connect with\".\n\nEventually, the band left their independent record label Lookout! Records on friendly terms, and signed to Reprise. Signing to a major label caused many of the band's original fans from the independent music club 924 Gilman Street to regard Green Day as sell-outs. The club has banned Green Day from entering since the major label signing. Reflecting back on the period, lead vocalist Billie Joe Armstrong told Spin magazine in 1999, \"I couldn't go back to the punk scene, whether we were the biggest success in the world or the biggest failure  The only thing I could do was get on my bike and go forward.\"\n\nRob Cavallo was chosen as the main producer of the album, with Jerry Finn as the mixer. Green Day originally gave the first demo tape to Cavallo, and after listening to it during the car ride home he sensed that \"had stumbled on something big.\" The band's recording session lasted three weeks and the album was remixed twice. Armstrong claimed that the band wanted to create a dry sound, \"Similar to the Sex Pistols' album or first Black Sabbath albums.\" The band felt the original mix to be unsatisfactory. Cavallo agreed, and it was remixed, at Fantasy Studios in Berkeley California. Armstrong later said of their studio experience, \"Everything was already written, all we had to do was play it.\"\n\nMuch of the album's content was written by Armstrong, except \"Emenius Sleepus\" which was co-written by Armstrong and bassist Mike Dirnt, and the hidden track, \"All By Myself\", which was composed and written by drummer Tré Cool. The album touched upon various experiences of the band members and included subjects like anxiety and panic attacks, masturbation, sexual orientation, boredom, and former girlfriends.\n\nThe single \"Longview\" had a signature bass line that bass player Dirnt wrote while under the influence of LSD. He originally forgot much of it, but the remembered portions were included in the song. Armstrong stated that the song was mainly about boredom, masturbation, and smoking cannabis, as evident in some of the lyrics (\"When masturbation's lost its fun/You're fucking breaking\").\n\t\n\n\"Welcome to Paradise\", the second single from Dookie, was originally on the second studio album by the band, Kerplunk. The song was re-recorded, with a less grainy sound for Dookie. The song never had an official music video, however, a certain live performance of the song is often associated as a music video. The video is located on Green Day's official website.\n\nThe radio-only single, \"She\", was written by Armstrong about a former girlfriend who showed him a feminist poem with an identical title. In return, Armstrong wrote the lyrics of \"She\" and showed them to her. She later moved to Ecuador, prompting Armstrong to put \"She\" on the album. The same ex-girlfriend is the topic of the songs \"Sassafras Roots\" and \"Chump\".\n\nAnother song, \"Coming Clean\", deals with Armstrong's coming to terms with his bisexuality when he was 16 and 17 years old. In his interview with The Advocate magazine, he says that although he has never had a relationship with a man, his sexuality has been \"something that comes up as a struggle in me\".\n\nThe hit single \"Basket Case\", which appeared on many singles charts worldwide, was also inspired by Armstrong's personal experiences. The song deals with Armstrong's anxiety attacks and feelings of \"going crazy\" prior to being diagnosed with a panic disorder. The music video was filmed in an abandoned mental institution.\n\nThe final single, \"When I Come Around\", was again inspired by a woman, though this time being about Armstrong's wife, then former girlfriend, Adrienne. Following a dispute between the couple, Armstrong left Adrienne to spend some time alone. The video featured the three band members walking around Berkeley and San Francisco at night, eventually ending up back at the original location. Future touring back up guitarist, Jason White, made a cameo in the video with his then-girlfriend.\n\nBillie Joe Armstrong wrote the song \"In The End\" about his mother and her boyfriend (similar to Why Do You Want Him). He is quoted saying: \"That song is about my mother's husband, it's not really about a girl, or like anyone directly related to me in a relationship. In the End's about my mother.\"\n\n[edit] Album name and art\n\nThe name of the album is a reference to the band members often suffering from diarrhea, which they referred to as \"liquid dookie\", as a result of eating spoiled food whilst on tour. Initially the band were to name the album \"Liquid Dookie\", however this was deemed \"too gross\", and so they settled on the name \"Dookie\".\n\nThe cover art is an illustration by Richie Bucher, which depicts bombs being dropped on people and buildings. In the center, there is an explosion, with the band's name at the top. Armstrong has since explained the meaning of the artwork:\n“ \tI wanted the art work to look really different. I wanted it to represent the East Bay and where we come from, because there's a lot of artists in the East Bay scene that are just as important as the music. So we talked to Richie Bucher. He did a 7-inch cover for this band called Raooul that I really liked. He's also been playing in bands in the East Bay for years. There's pieces of us buried on the album cover. There's one guy with his camera up in the air taking a picture with a beard. He took pictures of bands every weekend at Gilman's. The robed character that looks like Ozzy Osbourne is the woman on the cover of the first Ozzy album. Angus Young is in there somewhere too. The graffiti reading \"Twisted Dog Sisters\" refers to these two girls from Berkeley. I think the guy saying \"The fritter, fat boy\" was a reference to a local cop. \t”\n\nThe back cover on early prints of the CD featured a plush toy of Ernie from Sesame Street, which was airbrushed out of later prints for fear of litigation. Some rumors suggest that it was removed because it led parents to think that Dookie was a child's lullaby album or that the creators of Sesame Street had sued Green Day.\n\nUpon its release, Dookie charted in seven countries. The album peaked at number two on Billboard 200 in the United States, and was a success in several other countries, peaking as high as number one in New Zealand; the lowest peak in any country was in the United Kingdom at number 13. While all the singles from the album charted in a few countries, the hit single \"Basket Case\" entered the top 10 in the United Kingdom and Sweden. Later in 1995, the album received a Grammy Award for Best Alternative Music Album, with \"Longview\" and \"Basket Case\" both being nominated for a Grammy.\n\nThroughout the 1990s, Dookie continued to sell well, eventually receiving diamond certification in 1999; To date, Dookie has sold over 15 million copies worldwide and remains the band's best-selling album.\n\nOn April 18, 2009 Dookie was reissued on 180 gram vinyl for the 2nd annual 'Record Store Day'.\n\nThe album was well received by some critics, with Allmusic describing Dookie as \"a stellar piece of modern punk that many tried to emulate but nobody bettered\". In 1994, Time claimed Dookie as the third best album of the year, but the best rock album of 1994. The New York Times, in early 1995, described the sound of Dookie as, \"Punk turns into pop in fast, funny, catchy, high-powered songs about whining and channel-surfing; apathy has rarely sounded so passionate.\"\n\nHowever, many other music critics, and even some other mainstream bands, claimed the band had sold out for signing to a major label, and called them \"watered down punk imposters\". The New York Times, while complementary on the album's overall quality, noted that Dookie's pop sound only remotely resembled punk music. The band did not respond initially to these comments, but later claimed that they were \"just trying to be themselves\" and that \"it's our band, we can do whatever we want\". Dirnt claimed that the follow up album, Insomniac, one of the band's hardest albums lyrically and musically, was the band releasing their anger at all the criticism from critics and former fans.\n\nSince its release, Dookie has featured heavily in various \"must have\" lists compiled by the music media. Some of the more prominent of these lists to feature Dookie are shown below; this information is adapted from Acclaimed Music.\n\nKerrang! \tUnited Kingdom \tThe Kerrang! 100 Albums You Must Hear Before You Die 1998 \t33\nClassic Rock & Metal Hammer \tUnited Kingdom \tThe 200 Greatest Albums of the 90s \t2006 \t*\nRobert Dimery \tUnited States \t1001 Albums You Must Hear Before You Die \t2005 \t*\nRolling Stone \tUnited States \tRolling Stone's 500 Greatest Albums of All Time \t2003 \t193\nSpin Magazine \tUnited States \t100 Greatest Albums, 1985–2005 \t2005 \t44\nRock and Roll Hall of Fame \tUnited States \tThe Definitive 200\n\n <a href=\"http://www.last.fm/music/Green+Day/Dookie\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}